// Написати цикли, які роблять наступне:
//1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
//2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
//3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
//4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число, 
// більше 1, які не мають інших дільників крім 1 і себе).
//5 Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. 
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
// # 1
// let count: number = 20;
// for(count; count <= 30; count+=0.5){
//   console.log(`count : ${count}`)
// }
// # 2
var dollar = 41;
console.log("one dollar : ".concat(dollar, " UAH"));
for (var x = 10; x <= 100; x += 10) {
    var dollars = dollar * x;
    console.log("".concat(x, " $ dollars = ").concat(dollars, " UAH"));
}
