// Написати цикли, які роблять наступне:
//1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
//2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
//3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
//4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число,
// більше 1, які не мають інших дільників крім 1 і себе).
//5 Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
// # 1
// let count: number = 20;
// for(count; count <= 30; count+=0.5){
//   console.log(`count : ${count}`)
// }
// # 2
// let dollar: number = 41
// console.log(`one dollar : ${dollar} UAH`);
// for(let x = 10; x <= 100; x+=10) {
//   let dollars = dollar * x
//   console.log(`${x} $ dollars = ${dollars} UAH`);
// }
// # 3
// const num: number = Number(prompt('введіть квадрат чисел не більше 100: '))
// if (isNaN(num) || num <= 0) {
//   alert(`ви відмінили або ввели пусте поле`)
// }
// if (num <= 100) {
//   for(let sqrtNumber: number = 1; sqrtNumber <= num; sqrtNumber++) {
//     if (sqrtNumber ** 2 <= num){
//       console.log(`число : ${sqrtNumber}`);
//     } else {
//       break;
//     }
//   }
//   num && alert('результат дивимося у консолі.');
// } else {
//   alert(`ви ввели число : ${num} а це число більше 100`);
// }
// # 4
alert("З'ясувати, чи є число простим");
var num;
var trueNumber = true;
do {
    num = Number(prompt("введіть число :"));
    if (num === 1)
        alert("число 1 не є простим!");
    else if (isNaN(num))
        alert("ви ввели літери а потрібно ввести число");
} while (isNaN(num) || num === 1);
if (!num)
    alert("\u0432\u0438 \u043D\u0430\u0442\u0438\u0441\u043D\u0443\u043B\u0438 \u043A\u043D\u043E\u043F\u043A\u0443 \u0432\u0456\u0434\u043C\u0456\u043D\u0438! \u0430\u0431\u043E \u0432\u0432\u0435\u043B\u0438 \u043F\u0443\u0441\u0442\u0435 \u043F\u043E\u043B\u0435!");
if (num > 1) {
    for (var i = 2; i < num; i++) {
        if (num % i === 0) {
            trueNumber = false;
            break;
        }
    }
    if (trueNumber) {
        alert("\u0447\u0438\u0441\u043B\u043E: ".concat(num, " \u041F\u0440\u043E\u0441\u0442\u0435 \u0447\u0438\u0441\u043B\u043E!"));
    }
    else {
        alert("\u0447\u0438\u0441\u043B\u043E: ".concat(num, " \u041D\u0415 \u043F\u0440\u043E\u0441\u0442\u0435 \u0447\u0438\u0441\u043B\u043E"));
    }
}
